<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [1]:
import pandas as pd
import psycopg2

In [2]:
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [3]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [4]:
# текст запроса
query_3_1 = f'''select count(*)     -- кол-во всех строк(вакансий)
                from public.vacancies
            '''
df = pd.read_sql_query(query_3_1, connection)

c:\Users\User\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [5]:
df

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [6]:
query_3_2 = f'''select count(*)     -- кол-во всех строк(работодателей)
                from public.employers
            '''
df = pd.read_sql_query(query_3_2, connection)

c:\Users\User\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [7]:
df

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [8]:
query_3_3 = f'''select count(*)     -- кол-во всех строк(регионов)
                from public.areas
            '''
df = pd.read_sql_query(query_3_3, connection)

c:\Users\User\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [9]:
df

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [10]:
query_3_4 = f'''select count(*)     -- кол-во всех строк(сфер деятельности)
                from public.industries
            '''
df = pd.read_sql_query(query_3_4, connection)

c:\Users\User\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [11]:
df

   count
0    294

К моему удивлению, вакансий в примерно в два раза больше чем работодателей. А это значит, что среднестатистический работодатель предлагает 2 вакансии.

***

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [12]:
query_4_1 = f'''select 
                    a.name,     -- название региона
                    count(v.id) cnt     -- кол-во вакансий
                from public.vacancies v
                join public.areas a on v.area_id = a.id     -- создание общей таблицы с регионами и вакансиями
                group by 1      -- её группировка по названию региона
                order by 2 desc
            '''
df = pd.read_sql_query(query_4_1, connection)

c:\Users\User\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [13]:
df

                name   cnt
0             Москва  5333
1    Санкт-Петербург  2851
2              Минск  2112
3        Новосибирск  2006
4             Алматы  1892
..               ...   ...
764       Тарко-Сале     1
765    Новоаннинский     1
766            Бирск     1
767           Сасово     1
768             Анна     1

[769 rows x 2 columns]

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [14]:
query_4_2 = f'''select count(*)     -- кол-во всех строк(вакансий)
                from public.vacancies
                where (salary_from is not null) or (salary_to is not null)      -- условие сортировки по наличию хотя бы одного заполненого поля с зп
            '''
df = pd.read_sql_query(query_4_2, connection)

c:\Users\User\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [15]:
df

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [16]:
query_4_3 = f'''select 
                    round(avg(salary_from)),        -- среднее значение нижней границы зп
                    round(avg(salary_to))       -- среднее значение верхней границы зп
                from public.vacancies
            '''
df = pd.read_sql_query(query_4_3, connection)

c:\Users\User\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [17]:
df

     round     round
0  71065.0  110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [18]:
query_4_4 = f'''select 
                    count(*),       -- кол-во всех строк(вакансий)
                    schedule,       -- рабочий график
                    employment      -- тип трудоустройства
                from 
                    public.vacancies 
                group by 2, 3       -- создание всевозможних сочетаний для вышеуказанных признаков
                order by 1 desc     
            '''
            
df = pd.read_sql_query(query_4_4, connection)

c:\Users\User\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [19]:
df

    count          schedule           employment
0   35367       Полный день     Полная занятость
1    7802  Удаленная работа     Полная занятость
2    1593     Гибкий график     Полная занятость
3    1312  Удаленная работа  Частичная занятость
4     940    Сменный график     Полная занятость
5     569       Полный день           Стажировка
6     367    Вахтовый метод     Полная занятость
7     347       Полный день  Частичная занятость
8     312     Гибкий график  Частичная занятость
9     141       Полный день     Проектная работа
10    133  Удаленная работа     Проектная работа
11    116     Гибкий график           Стажировка
12    101    Сменный график  Частичная занятость
13     64  Удаленная работа           Стажировка
14     18     Гибкий график     Проектная работа
15     12    Сменный график           Стажировка
16      2    Вахтовый метод     Проектная работа
17      1    Сменный график     Проектная работа

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [20]:
query_4_5 = f'''select 
                    count(*),       -- кол-во всех строк(вакансий)
                    experience      -- опыт работы
                from 
                    public.vacancies 
                group by 2
                order by 1 asc
            '''
            
df = pd.read_sql_query(query_4_5, connection)

c:\Users\User\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [21]:
df

   count          experience
0   1337         Более 6 лет
1   7197           Нет опыта
2  14511       От 3 до 6 лет
3  26152  От 1 года до 3 лет

***

Наиболее популярными характеристиками для вакансий являются: расположение рабочего места в Москве, график - полный день, занятость - полная, требуемый опыт работы  - от 1 года до 3 лет, что в целом было предсказуемо. Также можно отметить, что лишь половина работодателей отметила хотя бы одну границу зарплаты, а ее(зарплаты) средний показатель от 70 до 110 тыс. рублей.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [22]:
query_5_1 = f'''select 
                    count(v.id),        -- кол-во всех строк (вакансий)
                    e.name      -- работодатель
                from 
                    public.vacancies v
                    join public.employers e on v.employer_id = e.id
                group by 2
                order by 1 desc
                limit 5
            '''
            
df = pd.read_sql_query(query_5_1, connection)

c:\Users\User\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [23]:
df

   count           name
0   1933         Яндекс
1    491     Ростелеком
2    444       Тинькофф
3    428           СБЕР
4    331  Газпром нефть

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [24]:
query_5_2 = f'''SELECT a.name area,     -- название региона
                    count(v.name) v_cnt,        -- кол-во вакансий
                    count(e.name) e_cnt         -- кол-во работодателей
            
                FROM public.areas a
                LEFT JOIN public.vacancies v ON a.id = v.area_id
                JOIN public.employers e ON a.id = e.area
                GROUP BY a.name 
                HAVING count(v.id) = {0}
                
                ORDER BY {3} DESC
            '''
            
df = pd.read_sql_query(query_5_2, connection)

c:\Users\User\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [25]:
df

                                          area  v_cnt  e_cnt
0                                       Россия      0    410
1                                    Казахстан      0    207
2                           Московская область      0     75
3                           Краснодарский край      0     19
4                                     Беларусь      0     18
..                                         ...    ...    ...
181                                    Удобная      0      1
182                Майна (Ульяновская область)      0      1
183                            Верхнетуломский      0      1
184                                    Жаркент      0      1
185  Михайловка (Уфимский район, Башкортостан)      0      1

[186 rows x 3 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [26]:
query_5_3 = f'''SELECT 
                    count(DISTINCT area_id),        -- кол-во уникальных названий регионов
                    employer_id     -- id работодателя
                FROM public.vacancies 
                GROUP BY 2
                ORDER BY 1 desc
            '''
            
df = pd.read_sql_query(query_5_3, connection)

c:\Users\User\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [27]:
df

       count  employer_id
0        181         1740
1        152         2748
2        116      5724811
3         88      5130287
4         71      3682876
...      ...          ...
14901      1       810278
14902      1       810313
14903      1       810551
14904      1       810688
14905      1       811902

[14906 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [28]:
query_5_4 = f'''SELECT 
                    count(e.name)       -- кол- всех работодателей
                FROM public.employers e
                LEFT JOIN public.employers_industries ei on ei.employer_id = e.id
                LEFT JOIN public.industries i ON i.id = ei.industry_id      -- создание общей таблицы с работодателями и сферами деятельности
                WHERE i.name IS NULL        -- условие отсутствия указанной сферы деятельности
            '''
            
df = pd.read_sql_query(query_5_4, connection)

c:\Users\User\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [29]:
df

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [30]:
query_5_5 = f'''SELECT 
                    e.name,     --  имя работодателя
                    count(ei.industry_id)       -- кол-во сфер деятельности
                FROM public.employers e
                RIGHT JOIN public.employers_industries ei on ei.employer_id = e.id      -- создание общей таблицы с именами работодатей и их сферами деятельности
                GROUP BY 1
                HAVING count(ei.industry_id) = 4
                ORDER BY 1
                OFFSET 2
                LIMIT 1
            '''
            
df = pd.read_sql_query(query_5_5, connection)

c:\Users\User\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [31]:
df

   name  count
0  2ГИС      4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [32]:
query_5_6 = f'''SELECT count(ei.employer_id)        -- кол-во работодателей
                FROM public.employers_industries ei 
                JOIN public.industries i on i.id = ei.industry_id
                WHERE i.name = 'Разработка программного обеспечения'
            '''
            
df = pd.read_sql_query(query_5_6, connection)

c:\Users\User\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [33]:
df

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [34]:
# parsing a list of cities from Wikipedia
import requests
from bs4 import BeautifulSoup

url = 'https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8'
response = requests.get(url)
page = BeautifulSoup(response.text, 'html.parser')      # сохраняем весь html-код страницы с городами
table_code = page.find('table', class_='standard sortable')     # находим таблицу, в которой они записаны
nontext_lst = table_code.find_all('a')      # так как все города представляютя в виде ссылок, выделяем их с помощью атрибута <a>
lst = []
for item in nontext_lst:        # конвертируем полученные объекты в текстовые
    lst.append(item.text)
cities = []
for item in lst:                # так как таблица содержит дополнительные ссылки не относящиеся к городам или другим именам собственным, фильтруем список с помощью istitle(). 
    if item[:1].istitle():      # Для этого используем лишь первые две буквы слова, ведь название города может состоять из некольких слов с заглавной буквы    
        cities.append(item)
cities = tuple(cities)      # превращаем список в кортеж чтобы после указать лишь переменную в запросе

# request
query_5_7 = f'''SELECT 
                    e.name,     -- имя работодателя
                    a.name,     -- название региона
                    count(v.id) cnt     -- кол-во вакансий
                FROM public.vacancies v 
                JOIN public.areas a on a.id = v.area_id
                JOIN public.employers e on v.employer_id = e.id     -- создание единой таблицы для вакансий, работодателей и регионов
                GROUP BY 1, 2
                HAVING e.name = 'Яндекс' AND a.name IN {cities} 
                                 
                UNION       -- присоединение строки 'total' с общим количеством вакансий в регионах
                
                SELECT
                    'Яндекс', 
                    'total', 
                    COUNT(*) 
                FROM public.vacancies v 
                JOIN public.areas a on a.id = v.area_id
                JOIN public.employers e on v.employer_id = e.id
                WHERE e.name = 'Яндекс' AND a.name IN {cities}
                ORDER BY 3
            '''

In [35]:
df = pd.read_sql_query(query_5_7, connection)
display(df)

c:\Users\User\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

      name             name  cnt
0   Яндекс             Омск   21
1   Яндекс        Челябинск   22
2   Яндекс       Красноярск   23
3   Яндекс        Волгоград   24
4   Яндекс            Пермь   25
5   Яндекс           Казань   25
6   Яндекс   Ростов-на-Дону   25
7   Яндекс              Уфа   26
8   Яндекс           Самара   26
9   Яндекс        Краснодар   30
10  Яндекс          Воронеж   32
11  Яндекс      Новосибирск   35
12  Яндекс  Нижний Новгород   36
13  Яндекс     Екатеринбург   39
14  Яндекс  Санкт-Петербург   42
15  Яндекс           Москва   54
16  Яндекс            total  485

***

В первой пятерке по количеству вакансий и регионов, в которых размещаются вакансии, Яндекс превышает сотальных примерно в 4 или 5 раз. Поскольку компании российские, логично, что (даже там, где нет вакансий) будет лидировать Россия. Также почти треть работодателей не указывают сферу своей деятельности, а единственная компания, у которой их 4 - это 2ГИС. Что касается городов-миллионников, в которых работает Яндекс, то эти города, по количеству вакансий в них располагаются вовсе не в порядке количества их населения. Чем это обусловлено, я не знаю, но деталь интересная.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [36]:
query_6_1 = f'''SELECT count(name)        -- кол-во вакансий
                FROM public.vacancies 
                WHERE lower(name) LIKE '%%data%%' OR
                      lower(name) LIKE '%%данн%%'           -- условие, которое проверяет, относится ли вакансия к данным по названию
             '''

In [37]:
request = pd.read_sql_query(query_6_1, connection)
display(request)

c:\Users\User\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [38]:
query_6_2 = f'''SELECT count(name)      -- кол-во вакансий
                FROM public.vacancies 
                WHERE (lower(name) LIKE '%%data scientist%%' 
                    OR lower(name) LIKE '%%data science%%' 
                    OR lower(name) LIKE '%%исследователь данных%%' 
                    OR (name LIKE '%%ML%%' AND lower(name) NOT LIKE '%%html%%')
                    OR lower(name) LIKE '%%machine learning%%' 
                    OR lower(name) LIKE '%%машинн%%обучен%%')
                    
                    AND (lower(name) LIKE '%%junior%%'
                    OR experience = 'Нет опыта' 
                    OR employment = 'Стажировка')       -- условие, которое проверяет, подходит ли вакансия для начинающего дата-сайентиста по названию, 
                                                        -- (не)требуемому опыту и типу трудоустройства
            '''

In [39]:
request = pd.read_sql_query(query_6_2, connection)
display(request)

c:\Users\User\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [40]:
query_6_3 = f'''SELECT count(name)      -- кол-во вакансий 
                FROM public.vacancies 
                WHERE (lower(name) LIKE '%%data scientist%%' 
                    OR lower(name) LIKE '%%data science%%' 
                    OR lower(name) LIKE '%%исследователь данных%%' 
                    OR (name LIKE '%%ML%%' AND lower(name) NOT LIKE '%%html%%')
                    OR lower(name) LIKE '%%machine learning%%' 
                    OR lower(name) LIKE '%%машинн%%обучен%%')
                    AND (lower(key_skills) LIKE '%%sql%%'
                    OR lower(key_skills) LIKE '%%postgres%%')       -- условие, которое проверяет, подходит ли вакансия для дата-сайентиста знающего SQL
            '''

In [41]:
request = pd.read_sql_query(query_6_3, connection)
display(request)

c:\Users\User\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [42]:
query_6_4 = f'''SELECT count(name)      -- кол-во вакансий 
                FROM public.vacancies 
                WHERE (lower(name) LIKE '%%data scientist%%' 
                    OR lower(name) LIKE '%%data science%%' 
                    OR lower(name) LIKE '%%исследователь данных%%' 
                    OR (name LIKE '%%ML%%' AND lower(name) NOT LIKE '%%html%%')
                    OR lower(name) LIKE '%%machine learning%%' 
                    OR lower(name) LIKE '%%машинн%%обучен%%')
                    AND (lower(key_skills) LIKE '%%python%%')       -- условие, которое проверяет, подходит ли вакансия для дата-сайентиста и указан ли в ней Python как ключевой навык.
            '''

In [43]:
request = pd.read_sql_query(query_6_4, connection)
display(request)

c:\Users\User\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [44]:
query_6_5 = f'''SELECT avg(length(key_skills) - length(replace(key_skills, chr(9), '')) + 1)
                FROM public.vacancies 
                WHERE (lower(name) LIKE '%%data scientist%%' 
                    OR lower(name) LIKE '%%data science%%' 
                    OR lower(name) LIKE '%%исследователь данных%%' 
                    OR (name LIKE '%%ML%%' AND lower(name) NOT LIKE '%%html%%')
                    OR lower(name) LIKE '%%machine learning%%' 
                    OR lower(name) LIKE '%%машинн%%обучен%%')
            '''

In [45]:
request = pd.read_sql_query(query_6_5, connection)
display(request)

c:\Users\User\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

        avg
0  6.406032

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [46]:
query_6_6 = f'''SELECT experience, 
                AVG(coalesce((salary_to + salary_from)/2, salary_to, salary_from))
                FROM public.vacancies    --таблица с вакансиями
                WHERE (lower(name) LIKE '%%data scientist%%' 
                    OR lower(name) LIKE '%%data science%%' 
                    OR lower(name) LIKE '%%исследователь данных%%' 
                    OR (name LIKE '%%ML%%' AND lower(name) NOT LIKE '%%html%%')
                    OR lower(name) LIKE '%%machine learning%%' 
                    OR lower(name) LIKE '%%машинн%%обучен%%') 
                    AND (salary_from IS NOT NULL 
                    OR salary_to IS NOT NULL)  
                GROUP BY experience'''

In [47]:
request = pd.read_sql_query(query_6_6, connection).round()
display(request)

c:\Users\User\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

           experience       avg
0           Нет опыта   74643.0
1  От 1 года до 3 лет  139675.0
2       От 3 до 6 лет  243115.0

***

Вакансии, которые относятся к работе с данными, составляют всего около 4% от общего количества вакансий, а вакансии для новичков в этой области без особого труда и вовсе можно перебрать вручную. Разработка на Python более преобладающий навык нежели знание SQL, но также они часто могут сочитаться вместе, ведь требованием многих работодателей является не один навык. Судя по последней таблице, опыт прямо пропорционален зарплате.

# Общий вывод по проекту

In [48]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования